require 'rubygems'
require 'active_record'

ActiveRecord::Base.establish_connection(
  :adapter => 'sqlite3',
  :database =>  'constitution.sqlite3.db'
)

ActiveRecord::Base.connection.create_table(:articles) do |t|
  t.integer :section_id
  t.text :content
  t.boolean :add_bullets, default: true
end

ActiveRecord::Base.connection.create_table(:sections) do |t|
  t.string :title
end

class Section < ActiveRecord::Base
  has_many :articles
end

class Article < ActiveRecord::Base
  belongs_to :section
end

Section.delete_all
Article.delete_all

Section.create id: 1, title: "ЗАГАЛЬНІ ЗАСАДИ"
Section.create id: 2, title: "ПРАВА, СВОБОДИ ТА ОБОВ'ЯЗКИ ЛЮДИНИ І ГРОМАДЯНИНА"
Section.create id: 3, title: "ВИБОРИ. РЕФЕРЕНДУМ"
Section.create id: 4, title: "ВЕРХОВНА РАДА УКРАЇНИ"
Section.create id: 5, title: "ПРЕЗИДЕНТ УКРАЇНИ"

Article.create id: 1, section_id: 1, content: "Україна є суверенна і незалежна, демократична, соціальна, правова держава.||http://zakon0.rada.gov.ua/laws/show/v003p710-12/paran54#n54"

Article.create id: 2, section_id: 1, content: "Суверенітет України поширюється на всю її територію.
Україна є унітарною державою.
Територія України в межах існуючого кордону є цілісною і недоторканною."

Article.create id: 3, section_id: 1, content: "Людина, її життя і здоров'я, честь і гідність, недоторканність і безпека визнаються в Україні найвищою соціальною цінністю.
Права і свободи людини та їх гарантії визначають зміст і спрямованість діяльності держави. Держава відповідає перед людиною за свою діяльність. Утвердження і забезпечення прав і свобод людини є головним обов'язком держави."

Article.create id: 4, section_id: 1, content: "В Україні існує єдине громадянство. Підстави набуття і припинення громадянства України визначаються законом."

Article.create id: 5, section_id: 1, content: "Україна є республікою.
Носієм суверенітету і єдиним джерелом влади в Україні є народ. Народ здійснює владу безпосередньо і через органи державної влади та органи місцевого самоврядування.||http://zakon0.rada.gov.ua/laws/show/v006p710-05|http://zakon0.rada.gov.ua/laws/show/v006p710-08
Право визначати і змінювати конституційний лад в Україні належить виключно народові і не може бути узурповане державою, її органами або посадовими особами.||http://zakon0.rada.gov.ua/laws/show/v006p710-05|http://zakon0.rada.gov.ua/laws/show/v006p710-08
Ніхто не може узурпувати державну владу.||http://zakon0.rada.gov.ua/laws/show/v006p710-05/paran54#n54"

Article.create id: 6, section_id: 1, content: "Державна влада в Україні здійснюється на засадах її поділу на законодавчу, виконавчу та судову.
Органи законодавчої, виконавчої та судової влади здійснюють свої повноваження у встановлених цією Конституцією межах і відповідно до законів України."

Article.create id: 7, section_id: 1, content: "В Україні визнається і гарантується місцеве самоврядування."

Article.create id: 8, section_id: 1, content: "В Україні визнається і діє принцип верховенства права.
Конституція України має найвищу юридичну силу. Закони та інші нормативно-правові акти приймаються на основі Конституції України і повинні відповідати їй.
Норми Конституції України є нормами прямої дії. Звернення до суду для захисту конституційних прав і свобод людини і громадянина безпосередньо на підставі Конституції України гарантується."

Article.create id: 9, section_id: 1, content: "Чинні міжнародні договори, згода на обов'язковість яких надана Верховною Радою України, є частиною національного законодавства України.
Укладення міжнародних договорів, які суперечать Конституції України, можливе лише після внесення відповідних змін до Конституції України."

Article.create id: 10, section_id: 1, content: "Державною мовою в Україні є українська мова.||http://zakon0.rada.gov.ua/laws/show/v010p710-99/paran54#n54
Держава забезпечує всебічний розвиток і функціонування української мови в усіх сферах суспільного життя на всій території України.
В Україні гарантується вільний розвиток, використання і захист російської, інших мов національних меншин України.
Держава сприяє вивченню мов міжнародного спілкування.
Застосування мов в Україні гарантується Конституцією України та визначається законом."

Article.create id: 11, section_id: 1, content: "Держава сприяє консолідації та розвиткові української нації, її історичної свідомості, традицій і культури, а також розвиткові етнічної, культурної, мовної та релігійної самобутності всіх корінних народів і національних меншин України."

Article.create id: 12, section_id: 1, content: "Україна дбає про задоволення національно-культурних і мовних потреб українців, які проживають за межами держави."

Article.create id: 13, section_id: 1, content: "Земля, її надра, атмосферне повітря, водні та інші природні ресурси, які знаходяться в межах території України, природні ресурси її континентального шельфу, виключної (морської) економічної зони є об'єктами права власності Українського народу. Від імені Українського народу права власника здійснюють органи державної влади та органи місцевого самоврядування в межах, визначених цією Конституцією.
Кожний громадянин має право користуватися природними об'єктами права власності народу відповідно до закону.
Власність зобов'язує. Власність не повинна використовуватися на шкоду людині і суспільству.
Держава забезпечує захист прав усіх суб'єктів права власності і господарювання, соціальну спрямованість економіки. Усі суб'єкти права власності рівні перед законом."

Article.create id: 14, section_id: 1, content: "Земля є основним національним багатством, що перебуває під особливою охороною держави.
Право власності на землю гарантується. Це право набувається і реалізується громадянами, юридичними особами та державою виключно відповідно до закону."

Article.create id: 15, section_id: 1, content: "Суспільне життя в Україні ґрунтується на засадах політичної, економічної та ідеологічної багатоманітності.
Жодна ідеологія не може визнаватися державою як обов'язкова.
Цензура заборонена.
Держава гарантує свободу політичної діяльності, не забороненої Конституцією і законами України."

Article.create id: 16, section_id: 1, content: "Забезпечення екологічної безпеки і підтримання екологічної рівноваги на території України, подолання наслідків Чорнобильської катастрофи - катастрофи планетарного масштабу, збереження генофонду Українського народу є обов'язком держави."

Article.create id: 17, section_id: 1, content: "Захист суверенітету і територіальної цілісності України, забезпечення її економічної та інформаційної безпеки є найважливішими функціями держави, справою всього Українського народу.
        Оборона України, захист її суверенітету, територіальної цілісності і недоторканності покладаються на Збройні Сили України.
        Забезпечення державної безпеки і захист державного кордону України покладаються на відповідні військові формування та правоохоронні органи держави, організація і порядок діяльності яких визначаються законом.
        Збройні Сили України та інші військові формування ніким не можуть бути використані для обмеження прав і свобод громадян або з метою повалення конституційного ладу, усунення органів влади чи перешкоджання їх діяльності.
        Держава забезпечує соціальний захист громадян України, які перебувають на службі у Збройних Силах України та в інших військових формуваннях, а також членів їхніх сімей.
        На території України забороняється створення і функціонування будь-яких збройних формувань, не передбачених законом.
        На території України не допускається розташування іноземних військових баз."

Article.create id: 18, section_id: 1, content: "Зовнішньополітична діяльність України спрямована на забезпечення її національних інтересів і безпеки шляхом підтримання мирного і взаємовигідного співробітництва з членами міжнародного співтовариства за загальновизнаними принципами і нормами міжнародного права."

Article.create id: 19, section_id: 1, content: "Правовий порядок в Україні ґрунтується на засадах, відповідно до яких ніхто не може бути примушений робити те, що не передбачено законодавством.
        Органи державної влади та органи місцевого самоврядування, їх посадові особи зобов'язані діяти лише на підставі, в межах повноважень та у спосіб, що передбачені Конституцією та законами України.||http://zakon0.rada.gov.ua/laws/show/v007p710-09/paran56#n56"

Article.create id: 20, section_id: 1, content: "Державними символами України є Державний Прапор України, Державний Герб України і Державний Гімн України.
        Державний Прапор України - стяг із двох рівновеликих горизонтальних смуг синього і жовтого кольорів.
        Великий Державний Герб України встановлюється з урахуванням малого Державного Герба України та герба Війська Запорізького законом, що приймається не менш як двома третинами від конституційного складу Верховної Ради України.
        Головним елементом великого Державного Герба України є Знак Княжої Держави Володимира Великого (малий Державний Герб України).
        Державний Гімн України - національний гімн на музику М. Вербицького із словами, затвердженими законом, що приймається не менш як двома третинами від конституційного складу Верховної Ради України.
        Опис державних символів України та порядок їх використання встановлюються законом, що приймається не менш як двома третинами від конституційного складу Верховної Ради України.
        Столицею України є місто Київ."

Article.create id: 21, section_id: 2, content: "Усі люди є вільні і рівні у своїй гідності та правах. Права і свободи людини є невідчужуваними та непорушними."

Article.create id: 22, section_id: 2, content: "Права і свободи людини і громадянина, закріплені цією Конституцією, не є вичерпними.
Конституційні права і свободи гарантуються і не можуть бути скасовані.
При прийнятті нових законів або внесенні змін до чинних законів не допускається звуження змісту та обсягу існуючих прав і свобод."

Article.create id: 23, section_id: 2, content: "Кожна людина має право на вільний розвиток своєї особистості, якщо при цьому не порушуються права і свободи інших людей, та має обов'язки перед суспільством, в якому забезпечується вільний і всебічний розвиток її особистості."

Article.create id: 24, section_id: 2, content: "Громадяни мають рівні конституційні права і свободи та є рівними перед законом.||http://zakon0.rada.gov.ua/laws/show/v009p710-12/paran2#n2
Не може бути привілеїв чи обмежень за ознаками раси, кольору шкіри, політичних, релігійних та інших переконань, статі, етнічного та соціального походження, майнового стану, місця проживання, за мовними або іншими ознаками.
Рівність прав жінки і чоловіка забезпечується: наданням жінкам рівних з чоловіками можливостей у громадсько-політичній і культурній діяльності, у здобутті освіти і професійній підготовці, у праці та винагороді за неї; спеціальними заходами щодо охорони праці і здоров'я жінок, встановленням пенсійних пільг; створенням умов, які дають жінкам можливість поєднувати працю з материнством; правовим захистом, матеріальною і моральною підтримкою материнства і дитинства, включаючи надання оплачуваних відпусток та інших пільг вагітним жінкам і матерям."

Article.create id: 25, section_id: 2, content: "Громадянин України не може бути позбавлений громадянства і права змінити громадянство.
Громадянин України не може бути вигнаний за межі України або виданий іншій державі.
Україна гарантує піклування та захист своїм громадянам, які перебувають за її межами."

Article.create id: 26, section_id: 2, content: "Іноземці та особи без громадянства, що перебувають в Україні на законних підставах, користуються тими самими правами і свободами, а також несуть такі самі обов'язки, як і громадяни України, - за винятками, встановленими Конституцією, законами чи міжнародними договорами України.
Іноземцям та особам без громадянства може бути надано притулок у порядку, встановленому законом."

Article.create id: 27, section_id: 2, content: "Кожна людина має невід'ємне право на життя.
Ніхто не може бути свавільно позбавлений життя. Обов'язок держави - захищати життя людини.
Кожен має право захищати своє життя і здоров'я, життя і здоров'я інших людей від протиправних посягань."

Article.create id: 28, section_id: 2, content: "Кожен має право на повагу до його гідності.
Ніхто не може бути підданий катуванню, жорстокому, нелюдському або такому, що принижує його гідність, поводженню чи покаранню.
Жодна людина без її вільної згоди не може бути піддана медичним, науковим чи іншим дослідам."

Article.create id: 29, section_id: 2, content: "Кожна людина має право на свободу та особисту недоторканність.
Ніхто не може бути заарештований або триматися під вартою інакше як за вмотивованим рішенням суду і тільки на підставах та в порядку, встановлених законом.
У разі нагальної необхідності запобігти злочинові чи його перепинити уповноважені на те законом органи можуть застосувати тримання особи під вартою як тимчасовий запобіжний захід, обґрунтованість якого протягом сімдесяти двох годин має бути перевірена судом. Затримана особа негайно звільняється, якщо протягом сімдесяти двох годин з моменту затримання їй не вручено вмотивованого рішення суду про тримання під вартою.
Кожному заарештованому чи затриманому має бути невідкладно повідомлено про мотиви арешту чи затримання, роз'яснено його права та надано можливість з моменту затримання захищати себе особисто та користуватися правовою допомогою захисника.||http://zakon0.rada.gov.ua/laws/show/1401-19/paran134#n134
Кожний затриманий має право у будь-який час оскаржити в суді своє затримання.
Про арешт або затримання людини має бути негайно повідомлено родичів заарештованого чи затриманого."

Article.create id: 30, section_id: 2, content: "Кожному гарантується недоторканність житла.
Не допускається проникнення до житла чи до іншого володіння особи, проведення в них огляду чи обшуку інакше як за вмотивованим рішенням суду.
У невідкладних випадках, пов'язаних із врятуванням життя людей та майна чи з безпосереднім переслідуванням осіб, які підозрюються у вчиненні злочину, можливий інший, встановлений законом, порядок проникнення до житла чи до іншого володіння особи, проведення в них огляду і обшуку."

Article.create id: 31, section_id: 2, content: "Кожному гарантується таємниця листування, телефонних розмов, телеграфної та іншої кореспонденції. Винятки можуть бути встановлені лише судом у випадках, передбачених законом, з метою запобігти злочинові чи з'ясувати істину під час розслідування кримінальної справи, якщо іншими способами одержати інформацію неможливо."

Article.create id: 32, section_id: 2, content: "Ніхто не може зазнавати втручання в його особисте і сімейне життя, крім випадків, передбачених Конституцією України.||http://zakon0.rada.gov.ua/laws/show/v002p710-12/paran51#n51
Не допускається збирання, зберігання, використання та поширення конфіденційної інформації про особу без її згоди, крім випадків, визначених законом, і лише в інтересах національної безпеки, економічного добробуту та прав людини.||http://zakon0.rada.gov.ua/laws/show/v002p710-12/paran51#n51
Кожний громадянин має право знайомитися в органах державної влади, органах місцевого самоврядування, установах і організаціях з відомостями про себе, які не є державною або іншою захищеною законом таємницею.
Кожному гарантується судовий захист права спростовувати недостовірну інформацію про себе і членів своєї сім'ї та права вимагати вилучення будь-якої інформації, а також право на відшкодування матеріальної і моральної шкоди, завданої збиранням, зберіганням, використанням та поширенням такої недостовірної інформації."

Article.create id: 33, section_id: 2, content: "Кожному, хто на законних підставах перебуває на території України, гарантується свобода пересування, вільний вибір місця проживання, право вільно залишати територію України, за винятком обмежень, які встановлюються законом.
Громадянин України не може бути позбавлений права в будь-який час повернутися в Україну."

Article.create id: 34, section_id: 2, content: "Кожному гарантується право на свободу думки і слова, на вільне вираження своїх поглядів і переконань.
Кожен має право вільно збирати, зберігати, використовувати і поширювати інформацію усно, письмово або в інший спосіб - на свій вибір.||http://zakon0.rada.gov.ua/laws/show/v002p710-12/paran51#n51
Здійснення цих прав може бути обмежене законом в інтересах національної безпеки, територіальної цілісності або громадського порядку з метою запобігання заворушенням чи злочинам, для охорони здоров'я населення, для захисту репутації або прав інших людей, для запобігання розголошенню інформації, одержаної конфіденційно, або для підтримання авторитету і неупередженості правосуддя.||http://zakon0.rada.gov.ua/laws/show/v002p710-12/paran51#n51"

Article.create id: 35, section_id: 2, content: "Кожен має право на свободу світогляду і віросповідання. Це право включає свободу сповідувати будь-яку релігію або не сповідувати ніякої, безперешкодно відправляти одноособово чи колективно релігійні культи і ритуальні обряди, вести релігійну діяльність.
Здійснення цього права може бути обмежене законом лише в інтересах охорони громадського порядку, здоров'я і моральності населення або захисту прав і свобод інших людей.
Церква і релігійні організації в Україні відокремлені від держави, а школа - від церкви. Жодна релігія не може бути визнана державою як обов'язкова.
Ніхто не може бути увільнений від своїх обов'язків перед державою або відмовитися від виконання законів за мотивами релігійних переконань. У разі якщо виконання військового обов'язку суперечить релігійним переконанням громадянина, виконання цього обов'язку має бути замінене альтернативною (невійськовою) службою."

Article.create id: 36, section_id: 2, content: "Громадяни України мають право на свободу об'єднання у політичні партії та громадські організації для здійснення і захисту своїх прав і свобод та задоволення політичних, економічних, соціальних, культурних та інших інтересів, за винятком обмежень, встановлених законом в інтересах національної безпеки та громадського порядку, охорони здоров'я населення або захисту прав і свобод інших людей.
Політичні партії в Україні сприяють формуванню і вираженню політичної волі громадян, беруть участь у виборах. Членами політичних партій можуть бути лише громадяни України. Обмеження щодо членства у політичних партіях встановлюються виключно цією Конституцією і законами України.
Громадяни мають право на участь у професійних спілках з метою захисту своїх трудових і соціально-економічних прав та інтересів. Професійні спілки є громадськими організаціями, що об'єднують громадян, пов'язаних спільними інтересами за родом їх професійної діяльності. Професійні спілки утворюються без попереднього дозволу на основі вільного вибору їх членів. Усі професійні спілки мають рівні права. Обмеження щодо членства у професійних спілках встановлюються виключно цією Конституцією і законами України.
Ніхто не може бути примушений до вступу в будь-яке об'єднання громадян чи обмежений у правах за належність чи неналежність до політичних партій або громадських організацій.
Усі об'єднання громадян рівні перед законом."

Article.create id: 37, section_id: 2, content: "Утворення і діяльність політичних партій та громадських організацій, програмні цілі або дії яких спрямовані на ліквідацію незалежності України, зміну конституційного ладу насильницьким шляхом, порушення суверенітету і територіальної цілісності держави, підрив її безпеки, незаконне захоплення державної влади, пропаганду війни, насильства, на розпалювання міжетнічної, расової, релігійної ворожнечі, посягання на права і свободи людини, здоров'я населення, забороняються.
Політичні партії та громадські організації не можуть мати воєнізованих формувань.
Не допускається створення і діяльність організаційних структур політичних партій в органах виконавчої та судової влади і виконавчих органах місцевого самоврядування, військових формуваннях, а також на державних підприємствах, у навчальних закладах та інших державних установах і організаціях.
Заборона діяльності об'єднань громадян здійснюється лише в судовому порядку."

Article.create id: 38, section_id: 2, content: "Громадяни мають право брати участь в управлінні державними справами, у всеукраїнському та місцевих референдумах, вільно обирати і бути обраними до органів державної влади та органів місцевого самоврядування.||http://zakon0.rada.gov.ua/laws/show/v007p710-99/paran54#n54
Громадяни користуються рівним правом доступу до державної служби, а також до служби в органах місцевого самоврядування."

Article.create id: 39, section_id: 2, content: "Громадяни мають право збиратися мирно, без зброї і проводити збори, мітинги, походи і демонстрації, про проведення яких завчасно сповіщаються органи виконавчої влади чи органи місцевого самоврядування.||http://zakon0.rada.gov.ua/laws/show/v004p710-01/paran54#n54
Обмеження щодо реалізації цього права може встановлюватися судом відповідно до закону і лише в інтересах національної безпеки та громадського порядку - з метою запобігання заворушенням чи злочинам, для охорони здоров'я населення або захисту прав і свобод інших людей."

Article.create id: 40, section_id: 2, content: "Усі мають право направляти індивідуальні чи колективні письмові звернення або особисто звертатися до органів державної влади, органів місцевого самоврядування та посадових і службових осіб цих органів, що зобов'язані розглянути звернення і дати обґрунтовану відповідь у встановлений законом строк."

Article.create id: 41, section_id: 2, content: "Кожен має право володіти, користуватися і розпоряджатися своєю власністю, результатами своєї інтелектуальної, творчої діяльності.
Право приватної власності набувається в порядку, визначеному законом.
Громадяни для задоволення своїх потреб можуть користуватися об'єктами права державної та комунальної власності відповідно до закону.
Ніхто не може бути протиправно позбавлений права власності. Право приватної власності є непорушним.
Примусове відчуження об'єктів права приватної власності може бути застосоване лише як виняток з мотивів суспільної необхідності, на підставі і в порядку, встановлених законом, та за умови попереднього і повного відшкодування їх вартості. Примусове відчуження таких об'єктів з наступним повним відшкодуванням їх вартості допускається лише в умовах воєнного чи надзвичайного стану.
Конфіскація майна може бути застосована виключно за рішенням суду у випадках, обсязі та порядку, встановлених законом.
Використання власності не може завдавати шкоди правам, свободам та гідності громадян, інтересам суспільства, погіршувати екологічну ситуацію і природні якості землі."

Article.create id: 42, section_id: 2, content: "Кожен має право на підприємницьку діяльність, яка не заборонена законом.
Підприємницька діяльність депутатів, посадових і службових осіб органів державної влади та органів місцевого самоврядування обмежується законом.
Держава забезпечує захист конкуренції у підприємницькій діяльності. Не допускаються зловживання монопольним становищем на ринку, неправомірне обмеження конкуренції та недобросовісна конкуренція. Види і межі монополії визначаються законом.
Держава захищає права споживачів, здійснює контроль за якістю і безпечністю продукції та усіх видів послуг і робіт, сприяє діяльності громадських організацій споживачів."

Article.create id: 43, section_id: 2, content: "Кожен має право на працю, що включає можливість заробляти собі на життя працею, яку він вільно обирає або на яку вільно погоджується.
Держава створює умови для повного здійснення громадянами права на працю, гарантує рівні можливості у виборі професії та роду трудової діяльності, реалізовує програми професійно-технічного навчання, підготовки і перепідготовки кадрів відповідно до суспільних потреб.
Використання примусової праці забороняється. Не вважається примусовою працею військова або альтернативна (невійськова) служба, а також робота чи служба, яка виконується особою за вироком чи іншим рішенням суду або відповідно до законів про воєнний і про надзвичайний стан.
Кожен має право на належні, безпечні і здорові умови праці, на заробітну плату, не нижчу від визначеної законом.
Використання праці жінок і неповнолітніх на небезпечних для їхнього здоров'я роботах забороняється.
Громадянам гарантується захист від незаконного звільнення.
Право на своєчасне одержання винагороди за працю захищається законом."

Article.create id: 44, section_id: 2, content: "Ті, хто працює, мають право на страйк для захисту своїх економічних і соціальних інтересів.
Порядок здійснення права на страйк встановлюється законом з урахуванням необхідності забезпечення національної безпеки, охорони здоров'я, прав і свобод інших людей.
Ніхто не може бути примушений до участі або до неучасті у страйку.
Заборона страйку можлива лише на підставі закону."

Article.create id: 45, section_id: 2, content: "Кожен, хто працює, має право на відпочинок.
Це право забезпечується наданням днів щотижневого відпочинку, а також оплачуваної щорічної відпустки, встановленням скороченого робочого дня щодо окремих професій і виробництв, скороченої тривалості роботи у нічний час.
Максимальна тривалість робочого часу, мінімальна тривалість відпочинку та оплачуваної щорічної відпустки, вихідні та святкові дні, а також інші умови здійснення цього права визначаються законом."

Article.create id: 46, section_id: 2, content: "Громадяни мають право на соціальний захист, що включає право на забезпечення їх у разі повної, часткової або тимчасової втрати працездатності, втрати годувальника, безробіття з незалежних від них обставин, а також у старості та в інших випадках, передбачених законом.
Це право гарантується загальнообов'язковим державним соціальним страхуванням за рахунок страхових внесків громадян, підприємств, установ і організацій, а також бюджетних та інших джерел соціального забезпечення; створенням мережі державних, комунальних, приватних закладів для догляду за непрацездатними.
Пенсії, інші види соціальних виплат та допомоги, що є основним джерелом існування, мають забезпечувати рівень життя, не нижчий від прожиткового мінімуму, встановленого законом."

Article.create id: 47, section_id: 2, content: "Кожен має право на житло. Держава створює умови, за яких кожний громадянин матиме змогу побудувати житло, придбати його у власність або взяти в оренду.
Громадянам, які потребують соціального захисту, житло надається державою та органами місцевого самоврядування безоплатно або за доступну для них плату відповідно до закону.
Ніхто не може бути примусово позбавлений житла інакше як на підставі закону за рішенням суду."

Article.create id: 48, section_id: 2, content: "Кожен має право на достатній життєвий рівень для себе і своєї сім'ї, що включає достатнє харчування, одяг, житло."

Article.create id: 49, section_id: 2, content: "Кожен має право на охорону здоров'я, медичну допомогу та медичне страхування.
Охорона здоров'я забезпечується державним фінансуванням відповідних соціально-економічних, медико-санітарних і оздоровчо-профілактичних програм.
Держава створює умови для ефективного і доступного для всіх громадян медичного обслуговування. У державних і комунальних закладах охорони здоров'я медична допомога надається безоплатно; існуюча мережа таких закладів не може бути скорочена. Держава сприяє розвиткові лікувальних закладів усіх форм власності.||http://zakon0.rada.gov.ua/laws/show/v010p710-02/paran54#n54
Держава дбає про розвиток фізичної культури і спорту, забезпечує санітарно-епідемічне благополуччя."

Article.create id: 50, section_id: 2, content: "Кожен має право на безпечне для життя і здоров'я довкілля та на відшкодування завданої порушенням цього права шкоди.
Кожному гарантується право вільного доступу до інформації про стан довкілля, про якість харчових продуктів і предметів побуту, а також право на її поширення. Така інформація ніким не може бути засекречена."

Article.create id: 51, section_id: 2, content: "Шлюб ґрунтується на вільній згоді жінки і чоловіка. Кожен із подружжя має рівні права і обов'язки у шлюбі та сім'ї.
Батьки зобов'язані утримувати дітей до їх повноліття. Повнолітні діти зобов'язані піклуватися про своїх непрацездатних батьків.
Сім'я, дитинство, материнство і батьківство охороняються державою."

Article.create id: 52, section_id: 2, content: "Діти рівні у своїх правах незалежно від походження, а також від того, народжені вони у шлюбі чи поза ним.
Будь-яке насильство над дитиною та її експлуатація переслідуються за законом.
Утримання та виховання дітей-сиріт і дітей, позбавлених батьківського піклування, покладається на державу. Держава заохочує і підтримує благодійницьку діяльність щодо дітей."

Article.create id: 53, section_id: 2, content: "Кожен має право на освіту.
Повна загальна середня освіта є обов'язковою.
Держава забезпечує доступність і безоплатність дошкільної, повної загальної середньої, професійно-технічної, вищої освіти в державних і комунальних навчальних закладах; розвиток дошкільної, повної загальної середньої, позашкільної, професійно-технічної, вищої і післядипломної освіти, різних форм навчання; надання державних стипендій та пільг учням і студентам.||http://zakon0.rada.gov.ua/laws/show/v005p710-04/paran54#n54
Громадяни мають право безоплатно здобути вищу освіту в державних і комунальних навчальних закладах на конкурсній основі.
Громадянам, які належать до національних меншин, відповідно до закону гарантується право на навчання рідною мовою чи на вивчення рідної мови у державних і комунальних навчальних закладах або через національні культурні товариства."

Article.create id: 54, section_id: 2, content: "Громадянам гарантується свобода літературної, художньої, наукової і технічної творчості, захист інтелектуальної власності, їхніх авторських прав, моральних і матеріальних інтересів, що виникають у зв'язку з різними видами інтелектуальної діяльності.
Кожний громадянин має право на результати своєї інтелектуальної, творчої діяльності; ніхто не може використовувати або поширювати їх без його згоди, за винятками, встановленими законом.
Держава сприяє розвиткові науки, встановленню наукових зв'язків України зі світовим співтовариством.
Культурна спадщина охороняється законом.
Держава забезпечує збереження історичних пам'яток та інших об'єктів, що становлять культурну цінність, вживає заходів для повернення в Україну культурних цінностей народу, які знаходяться за її межами."

Article.create id: 55, section_id: 2, content: "Права і свободи людини і громадянина захищаються судом.||http://zakon0.rada.gov.ua/laws/show/v009p710-97/paran54#n54
Кожному гарантується право на оскарження в суді рішень, дій чи бездіяльності органів державної влади, органів місцевого самоврядування, посадових і службових осіб.||http://zakon0.rada.gov.ua/laws/show/v006p710-97|http://zakon0.rada.gov.ua/laws/show/v019p710-11
Кожен має право звертатися за захистом своїх прав до Уповноваженого Верховної Ради України з прав людини.
<span class=\"new-row\">Кожному гарантується право звернутись із конституційною скаргою до Конституційного Суду України з підстав, установлених цією Конституцією, та у порядку, визначеному законом.</span>||http://zakon0.rada.gov.ua/laws/show/1401-19/paran136#n136
Кожен має право після використання всіх національних засобів <span class=\"removed-text\">правового</span>юридичного захисту звертатися за захистом своїх прав і свобод до відповідних міжнародних судових установ чи до відповідних органів міжнародних організацій, членом або учасником яких є Україна.||http://zakon0.rada.gov.ua/laws/show/1401-19/paran139#n139
Кожен має право будь-якими не забороненими законом засобами захищати свої права і свободи від порушень і протиправних посягань."

Article.create id: 56, section_id: 2, content: "Кожен має право на відшкодування за рахунок держави чи органів місцевого самоврядування матеріальної та моральної шкоди, завданої незаконними рішеннями, діями чи бездіяльністю органів державної влади, органів місцевого самоврядування, їх посадових і службових осіб при здійсненні ними своїх повноважень."

Article.create id: 57, section_id: 2, content: "Кожному гарантується право знати свої права і обов'язки.
Закони та інші нормативно-правові акти, що визначають права і обов'язки громадян, мають бути доведені до відома населення у порядку, встановленому законом.
Закони та інші нормативно-правові акти, що визначають права і обов'язки громадян, не доведені до відома населення у порядку, встановленому законом, є нечинними."

Article.create id: 58, section_id: 2, content: "Закони та інші нормативно-правові акти не мають зворотної дії в часі, крім випадків, коли вони пом'якшують або скасовують відповідальність особи.||http://zakon0.rada.gov.ua/laws/show/v001p710-99/paran54#n54
Ніхто не може відповідати за діяння, які на час їх вчинення не визнавалися законом як правопорушення.||http://zakon0.rada.gov.ua/laws/show/v001p710-97|http://zakon0.rada.gov.ua/laws/show/v006p710-00"

Article.create id: 59, section_id: 2, content: "Кожен має право на <span class=\"removed-text\">правову</span>професійну правничу допомогу. У випадках, передбачених законом, ця допомога надається безоплатно. Кожен є вільним у виборі захисника своїх прав.||http://zakon0.rada.gov.ua/laws/show/1401-19/paran141#n141|http://zakon0.rada.gov.ua/laws/show/v013p710-00/paran54#n54|http://zakon0.rada.gov.ua/laws/show/v023p710-09/paran54#n54
<span class=\"removed-row\">Для забезпечення права на захист від обвинувачення та надання правової допомоги при вирішенні справ у судах та інших державних органах в Україні діє адвокатура.</span>||http://zakon0.rada.gov.ua/laws/show/1401-19/paran142#n142"

Article.create id: 60, section_id: 2, content: "Ніхто не зобов'язаний виконувати явно злочинні розпорядження чи накази.
За віддання і виконання явно злочинного розпорядження чи наказу настає юридична відповідальність."

Article.create id: 61, section_id: 2, content: "Ніхто не може бути двічі притягнений до юридичної відповідальності одного виду за одне й те саме правопорушення.
Юридична відповідальність особи має індивідуальний характер."

Article.create id: 62, section_id: 2, content: "Особа вважається невинуватою у вчиненні злочину і не може бути піддана кримінальному покаранню, доки її вину не буде доведено в законному порядку і встановлено обвинувальним вироком суду.
Ніхто не зобов'язаний доводити свою невинуватість у вчиненні злочину.
Обвинувачення не може ґрунтуватися на доказах, одержаних незаконним шляхом, а також на припущеннях. Усі сумніви щодо доведеності вини особи тлумачаться на її користь.||http://zakon0.rada.gov.ua/laws/show/v012p710-11/paran54#n54
У разі скасування вироку суду як неправосудного держава відшкодовує матеріальну і моральну шкоду, завдану безпідставним засудженням."

Article.create id: 63, section_id: 2, content: "Особа не несе відповідальності за відмову давати показання або пояснення щодо себе, членів сім'ї чи близьких родичів, коло яких визначається законом.
Підозрюваний, обвинувачений чи підсудний має право на захист.
Засуджений користується всіма правами людини і громадянина, за винятком обмежень, які визначені законом і встановлені вироком суду."

Article.create id: 64, section_id: 2, content: "Конституційні права і свободи людини і громадянина не можуть бути обмежені, крім випадків, передбачених Конституцією України.
В умовах воєнного або надзвичайного стану можуть встановлюватися окремі обмеження прав і свобод із зазначенням строку дії цих обмежень. Не можуть бути обмежені права і свободи, передбачені статтями #24, #25, #27, #28, #29, #40, #47, #51, #52, #55, #56, #57, #58, #59, #60, #61, #62, #63 цієї Конституції.||http://zakon0.rada.gov.ua/laws/show/v009p710-97/paran54#n54"

Article.create id: 65, section_id: 2, content: "Захист Вітчизни, незалежності та територіальної цілісності України, шанування її державних символів є обов'язком громадян України.
Громадяни відбувають військову службу відповідно до закону."

Article.create id: 66, section_id: 2, content: "Кожен зобов'язаний не заподіювати шкоду природі, культурній спадщині, відшкодовувати завдані ним збитки."

Article.create id: 67, section_id: 2, content: "Кожен зобов'язаний сплачувати податки і збори в порядку і розмірах, встановлених законом.
Усі громадяни щорічно подають до податкових інспекцій за місцем проживання декларації про свій майновий стан та доходи за минулий рік у порядку, встановленому законом."

Article.create id: 68, section_id: 2, content: "Кожен зобов'язаний неухильно додержуватися Конституції України та законів України, не посягати на права і свободи, честь і гідність інших людей.
Незнання законів не звільняє від юридичної відповідальності."

Article.create id: 69, section_id: 3, content: "Народне волевиявлення здійснюється через вибори, референдум та інші форми безпосередньої демократії.||http://zakon0.rada.gov.ua/laws/show/v006p710-08/paran54#n54"

Article.create id: 70, section_id: 3, content: "Право голосу на виборах і референдумах мають громадяни України, які досягли на день їх проведення вісімнадцяти років.
Не мають права голосу громадяни, яких визнано судом недієздатними."

Article.create id: 71, section_id: 3, content: "Вибори до органів державної влади та органів місцевого самоврядування є вільними і відбуваються на основі загального, рівного і прямого виборчого права шляхом таємного голосування.
Виборцям гарантується вільне волевиявлення."

Article.create id: 72, section_id: 3, content: "Всеукраїнський референдум призначається Верховною Радою України або Президентом України відповідно до їхніх повноважень, встановлених цією Конституцією.
Всеукраїнський референдум проголошується за народною ініціативою на вимогу не менш як трьох мільйонів громадян України, які мають право голосу, за умови, що підписи щодо призначення референдуму зібрано не менш як у двох третинах областей і не менш як по сто тисяч підписів у кожній області.||http://zakon0.rada.gov.ua/laws/show/v006p710-08/paran54#n54"

Article.create id: 73, section_id: 3, content: "Виключно всеукраїнським референдумом вирішуються питання про зміну території України."

Article.create id: 74, section_id: 3, content: "Референдум не допускається щодо законопроектів з питань податків, бюджету та амністії."


Article.create id: 75, section_id: 4, content: "Єдиним органом законодавчої влади в Україні є парламент - Верховна Рада України.||http://zakon0.rada.gov.ua/laws/show/v017p710-02/paran54#n54"

Article.create id: 76, section_id: 4, content: "Конституційний склад Верховної Ради України - чотириста п’ятдесят народних депутатів України, які обираються на основі загального, рівного і прямого виборчого права шляхом таємного голосування строком на п’ять років.
Народним депутатом України може бути обрано громадянина України, який на день виборів досяг двадцяти одного року, має право голосу і проживає в Україні протягом останніх п’яти років.
Не може бути обраним до Верховної Ради України громадянин, який має судимість за вчинення умисного злочину, якщо ця судимість не погашена і не знята у встановленому законом порядку.
Повноваження народних депутатів України визначаються Конституцією та законами України.
Строк повноважень Верховної Ради України становить п’ять років||http://zakon0.rada.gov.ua/laws/show/742-18/paran6#n6"

Article.create id: 77, section_id: 4, content: "Чергові вибори до Верховної Ради України відбуваються в останню неділю жовтня п’ятого року повноважень Верховної Ради України.||http://zakon0.rada.gov.ua/laws/show/2952-17|http://zakon0.rada.gov.ua/laws/show/742-18/paran115#n115
Позачергові вибори до Верховної Ради України призначаються Президентом України і проводяться в період шістдесяти днів з дня опублікування рішення про дострокове припинення повноважень Верховної Ради України.
Порядок проведення виборів народних депутатів України встановлюється законом."

Article.create id: 78, section_id: 4, content: "Народні депутати України здійснюють свої повноваження на постійній основі.
Народні депутати України не можуть мати іншого представницького мандата, бути на державній службі, обіймати інші оплачувані посади, займатися іншою оплачуваною або підприємницькою діяльністю (крім викладацької, наукової та творчої діяльності), входити до складу керівного органу чи наглядової ради підприємства або організації, що має на меті одержання прибутку.
Вимоги щодо несумісності депутатського мандата з іншими видами діяльності встановлюються законом.
У разі виникнення обставин, що порушують вимоги щодо несумісності депутатського мандата з іншими видами діяльності, народний депутат України у двадцятиденний строк з дня виникнення таких обставин припиняє таку діяльність або подає особисту заяву про складення повноважень народного депутата України.||http://zakon0.rada.gov.ua/laws/show/742-18/paran6#n6"

Article.create id: 79, section_id: 4, content: "Перед вступом на посаду народні депутати України складають перед Верховною Радою України таку присягу:<br/><blockquote>\"Присягаю на вірність Україні. Зобов'язуюсь усіма своїми діями боронити суверенітет і незалежність України, дбати про благо Вітчизни і добробут Українського народу.<br/>Присягаю додержуватися Конституції України та законів України, виконувати свої обов'язки в інтересах усіх співвітчизників\".</blockquote>
Присягу зачитує найстарший за віком народний депутат України перед відкриттям першої сесії новообраної Верховної Ради України, після чого депутати скріплюють присягу своїми підписами під її текстом.
Відмова скласти присягу має наслідком втрату депутатського мандата.
Повноваження народних депутатів України починаються з моменту складення присяги.||http://zakon0.rada.gov.ua/laws/show/v001p710-97/paran54#n54"

Article.create id: 80, section_id: 4, content: "Народним депутатам України гарантується депутатська недоторканність.||http://zakon0.rada.gov.ua/laws/show/v012p710-03/paran54#n54
Народні депутати України не несуть юридичної відповідальності за результати голосування або висловлювання у парламенті та його органах, за винятком відповідальності за образу чи наклеп.
Народні депутати України не можуть бути без згоди Верховної Ради України притягнені до кримінальної відповідальності, затримані чи заарештовані.||http://zakon0.rada.gov.ua/laws/show/v009p710-99|http://zakon0.rada.gov.ua/laws/show/v012p710-03"

Article.create id: 81, section_id: 4, content: "Повноваження народних депутатів України припиняються одночасно з припиненням повноважень Верховної Ради України.
Повноваження народного депутата України припиняються достроково у разі:
1) складення повноважень за його особистою заявою;
2) набрання законної сили обвинувальним вироком щодо нього;
3) визнання його судом недієздатним або безвісно відсутнім;
4) припинення його громадянства або його виїзду на постійне проживання за межі України;
5) якщо протягом двадцяти днів з дня виникнення обставин, які призводять до порушення вимог щодо несумісності депутатського мандата з іншими видами діяльності, ці обставини ним не усунуто;
6) невходження народного депутата України, обраного від політичної партії (виборчого блоку політичних партій), до складу депутатської фракції цієї політичної партії (виборчого блоку політичних партій) або виходу народного депутата України із складу такої фракції;
7) його смерті.
Повноваження народного депутата України припиняються достроково також у разі дострокового припинення відповідно до Конституції України повноважень Верховної Ради України - в день відкриття першого засідання Верховної Ради України нового скликання.
Рішення про дострокове припинення повноважень народного депутата України у випадках, передбачених пунктами 1, 4 частини другої цієї статті, приймається Верховною Радою України, а у випадку, передбаченому пунктом 5 частини другої цієї статті, - судом.
У разі набрання законної сили обвинувальним вироком суду щодо народного депутата України, визнання народного депутата України недієздатним або безвісно відсутнім його повноваження припиняються з дня набрання законної сили рішенням суду, а в разі смерті народного депутата України - з дня смерті, засвідченої свідоцтвом про смерть.
У разі невходження народного депутата України, обраного від політичної партії (виборчого блоку політичних партій), до складу депутатської фракції цієї політичної партії (виборчого блоку політичних партій) або виходу народного депутата України із складу такої фракції його повноваження припиняються достроково на підставі закону за рішенням вищого керівного органу відповідної політичної партії (виборчого блоку політичних партій) з дня прийняття такого рішення.||http://zakon0.rada.gov.ua/laws/show/742-18/paran6#n6", add_bullets: false

Article.create id: 82, section_id: 4, content: "Верховна Рада України працює сесійно.
Верховна Рада України є повноважною за умови обрання не менш як двох третин від її конституційного складу.
Верховна Рада України збирається на першу сесію не пізніше ніж на тридцятий день після офіційного оголошення результатів виборів.
Перше засідання новообраної Верховної Ради України відкриває найстарший за віком народний депутат України.||http://zakon0.rada.gov.ua/laws/show/742-18/paran6#n6"

Article.create id: 83, section_id: 4, content: "Чергові сесії Верховної Ради України починаються першого вівторка лютого і першого вівторка вересня кожного року.
Позачергові сесії Верховної Ради України, із зазначенням порядку денного, скликаються Головою Верховної Ради України на вимогу Президента України або на вимогу не менш як третини народних депутатів України від конституційного складу Верховної Ради України.
У разі оголошення указу Президента України про введення воєнного чи надзвичайного стану в Україні або окремих її місцевостях Верховна Рада України збирається на засідання у дводенний строк без скликання.
У разі закінчення строку повноважень Верховної Ради України під час дії воєнного чи надзвичайного стану її повноваження продовжуються до дня першого засідання першої сесії Верховної Ради України, обраної після скасування воєнного чи надзвичайного стану.
Порядок роботи Верховної Ради України встановлюється Конституцією України та <a target=\"blank\" href=\"http://zakon0.rada.gov.ua/laws/show/1861-17\">Регламентом Верховної Ради України</a>.
У Верховній Раді України за результатами виборів і на основі узгодження політичних позицій формується коаліція депутатських фракцій, до складу якої входить більшість народних депутатів України від конституційного складу Верховної Ради України.
Коаліція депутатських фракцій у Верховній Раді України формується протягом одного місяця з дня відкриття першого засідання Верховної Ради України, що проводиться після чергових або позачергових виборів Верховної Ради України, або протягом місяця з дня припинення діяльності коаліції депутатських фракцій у Верховній Раді України.
Коаліція депутатських фракцій у Верховній Раді України відповідно до цієї Конституції вносить пропозиції Президенту України щодо кандидатури Прем’єр-міністра України, а також відповідно до цієї Конституції вносить пропозиції щодо кандидатур до складу Кабінету Міністрів України.
Засади формування, організації діяльності та припинення діяльності коаліції депутатських фракцій у Верховній Раді України встановлюються Конституцією України та <a target=\"blank\" href=\"http://zakon0.rada.gov.ua/laws/show/1861-17\">Регламентом Верховної Ради України</a>.
Депутатська фракція у Верховній Раді України, до складу якої входить більшість народних депутатів України від конституційного складу Верховної Ради України, має права коаліції депутатських фракцій у Верховній Раді України, передбачені цією Конституцією.||http://zakon0.rada.gov.ua/laws/show/742-18/paran6#n6"

Article.create id: 84, section_id: 4, content: "Засідання Верховної Ради України проводяться відкрито. Закрите засідання проводиться за рішенням більшості від конституційного складу Верховної Ради України.
Рішення Верховної Ради України приймаються виключно на її пленарних засіданнях шляхом голосування.||http://zakon0.rada.gov.ua/laws/show/v011p710-98|http://zakon0.rada.gov.ua/laws/show/v016p710-03
Голосування на засіданнях Верховної Ради України здійснюється народним депутатом України особисто.||http://zakon0.rada.gov.ua/laws/show/v011p710-98/paran54#n54|http://zakon0.rada.gov.ua/laws/show/v017p710-02/paran54#n54"

Article.create id: 85, section_id: 4, content: "До повноважень Верховної Ради України належить:
1) внесення змін до Конституції України в межах і порядку, передбачених розділом XIII цієї Конституції;
2) призначення всеукраїнського референдуму з питань, визначених статтею 73 цієї Конституції;
3) прийняття законів;
4) затвердження Державного бюджету України та внесення змін до нього, контроль за виконанням Державного бюджету України, прийняття рішення щодо звіту про його виконання;
5) визначення засад внутрішньої і зовнішньої політики;
6) затвердження загальнодержавних програм економічного, науково-технічного, соціального, національно-культурного розвитку, охорони довкілля;
7) призначення виборів Президента України у строки, передбачені цією Конституцією;
8) заслуховування щорічних та позачергових послань Президента України про внутрішнє і зовнішнє становище України;
9) оголошення за поданням Президента України стану війни і укладення миру, схвалення рішення Президента України про використання Збройних Сил України та інших військових формувань у разі збройної агресії проти України;
10) усунення Президента України з поста в порядку особливої процедури (імпічменту), встановленому статтею 111 цієї Конституції;
11) розгляд і прийняття рішення щодо схвалення Програми діяльності Кабінету Міністрів України;
12) призначення за поданням Президента України Прем’єр-міністра України, Міністра оборони України, Міністра закордонних справ України, призначення за поданням Прем’єр-міністра України інших членів Кабінету Міністрів України, Голови Антимонопольного комітету України, Голови Державного комітету телебачення і радіомовлення України, Голови Фонду державного майна України, звільнення зазначених осіб з посад, вирішення питання про відставку Прем’єр-міністра України, членів Кабінету Міністрів України;
12-1) призначення на посаду та звільнення з посади за поданням Президента України Голови Служби безпеки України;
13) здійснення контролю за діяльністю Кабінету Міністрів України відповідно до цієї Конституції та закону;
14) затвердження рішень про надання Україною позик і економічної допомоги іноземним державам та міжнародним організаціям, а також про одержання Україною від іноземних держав, банків і міжнародних фінансових організацій позик, не передбачених Державним бюджетом України, здійснення контролю за їх використанням;
15) прийняття Регламенту Верховної Ради України;
16) призначення на посади та звільнення з посад Голови та інших членів Рахункової палати;
17) призначення на посаду та звільнення з посади Уповноваженого Верховної Ради України з прав людини; заслуховування його щорічних доповідей про стан дотримання та захисту прав і свобод людини в Україні;
18) призначення на посаду та звільнення з посади Голови Національного банку України за поданням Президента України;
19) призначення на посади та звільнення з посад половини складу Ради Національного банку України;
20) призначення на посади та звільнення з посад половини складу Національної ради України з питань телебачення і радіомовлення;
21) призначення на посади та звільнення з посад членів Центральної виборчої комісії за поданням Президента України;
22) затвердження загальної структури, чисельності, визначення функцій Служби безпеки України, Збройних Сил України, інших утворених відповідно до законів України військових формувань, а також Міністерства внутрішніх справ України;
23) схвалення рішення про надання військової допомоги іншим державам, про направлення підрозділів Збройних Сил України до іншої держави чи про допуск підрозділів збройних сил інших держав на територію України;
24) встановлення державних символів України;
25) надання згоди на призначення на посаду та звільнення з посади Президентом України Генерального прокурора <span class=\"removed-text\">України</span>; висловлення недовіри Генеральному прокуророві <span class=\"removed-text\">України</span>, що має наслідком його відставку з посади; ||http://zakon0.rada.gov.ua/laws/show/1401-19/paran144#n144
26) призначення на посади <span class=\"removed-text\">та звільнення з посад</span> третини складу Конституційного Суду України;||http://zakon0.rada.gov.ua/laws/show/1401-19/paran144#n144
<span class=\"removed-row\">27) обрання суддів безстроково;<span>
28) дострокове припинення повноважень Верховної Ради Автономної Республіки Крим за наявності висновку Конституційного Суду України про порушення нею Конституції України або законів України; призначення позачергових виборів до Верховної Ради Автономної Республіки Крим;
29) утворення і ліквідація районів, встановлення і зміна меж районів і міст, віднесення населених пунктів до категорії міст, найменування і перейменування населених пунктів і районів;
30) призначення чергових та позачергових виборів до органів місцевого самоврядування;
31) затвердження протягом двох днів з моменту звернення Президента України указів про введення воєнного чи надзвичайного стану в Україні або в окремих її місцевостях, про загальну або часткову мобілізацію, про оголошення окремих місцевостей зонами надзвичайної екологічної ситуації;
32) надання законом згоди на обов’язковість міжнародних договорів України та денонсація міжнародних договорів України;
33) здійснення парламентського контролю у межах, визначених цією Конституцією та законом;
34) прийняття рішення про направлення запиту до Президента України на вимогу народного депутата України, групи народних депутатів України чи комітету Верховної Ради України, попередньо підтриману не менш як однією третиною від конституційного складу Верховної Ради України;
35) призначення на посаду та звільнення з посади керівника апарату Верховної Ради України; затвердження кошторису Верховної Ради України та структури її апарату;
36) затвердження переліку об’єктів права державної власності, що не підлягають приватизації, визначення правових засад вилучення об’єктів права приватної власності;
37) затвердження законом Конституції Автономної Республіки Крим, змін до неї.
Верховна Рада України здійснює також інші повноваження, які відповідно до Конституції України віднесені до її відання.||http://zakon0.rada.gov.ua/laws/show/742-18/paran6#n6", add_bullets: false

Article.create id: 86, section_id: 4, content: "Народний депутат України має право на сесії Верховної Ради України звернутися із запитом до органів Верховної Ради України, до Кабінету Міністрів України, до керівників інших органів державної влади та органів місцевого самоврядування, а також до керівників підприємств, установ і організацій, розташованих на території України, незалежно від їх підпорядкування і форм власності.||http://zakon0.rada.gov.ua/laws/show/v004p710-99|http://zakon0.rada.gov.ua/laws/show/v004p710-00|http://zakon0.rada.gov.ua/laws/show/v004p710-02|http://zakon0.rada.gov.ua/laws/show/v005p710-03|http://zakon0.rada.gov.ua/laws/show/v016p710-03
Керівники органів державної влади та органів місцевого самоврядування, підприємств, установ і організацій зобов'язані повідомити народного депутата України про результати розгляду його запиту."

Article.create id: 87, section_id: 4, content: "Верховна Рада України за пропозицією Президента України або не менш як однієї третини народних депутатів України від конституційного складу Верховної Ради України може розглянути питання про відповідальність Кабінету Міністрів України та прийняти резолюцію недовіри Кабінету Міністрів України більшістю від конституційного складу Верховної Ради України.
Питання про відповідальність Кабінету Міністрів України не може розглядатися Верховною Радою України більше одного разу протягом однієї чергової сесії, а також протягом року після схвалення Програми діяльності Кабінету Міністрів України або протягом останньої сесії Верховної Ради України.||http://zakon0.rada.gov.ua/laws/show/742-18/paran6#n6"

Article.create id: 88, section_id: 4, content: "Верховна Рада України обирає із свого складу Голову Верховної Ради України, Першого заступника і заступника Голови Верховної Ради України та відкликає їх з цих посад.||http://zakon0.rada.gov.ua/laws/show/742-18/paran118#n118
Голова Верховної Ради України:
1) веде засідання Верховної Ради України;
2) організовує роботу Верховної Ради України, координує діяльність її органів;||http://zakon0.rada.gov.ua/laws/show/742-18/paran120#n120
3) підписує акти, прийняті Верховною Радою України;
4) представляє Верховну Раду України у зносинах з іншими органами державної влади України та органами влади інших держав;
5) організовує роботу апарату Верховної Ради України.
Голова Верховної Ради України здійснює повноваження, передбачені цією Конституцією, у порядку, встановленому <a href=\"http://zakon0.rada.gov.ua/laws/show/1861-17\">Регламентом Верховної Ради України</a>.||http://zakon0.rada.gov.ua/laws/show/742-18/paran122#n122", add_bullets: false

Article.create id: 89, section_id: 4, content: "Верховна Рада України для здійснення законопроектної роботи, підготовки і попереднього розгляду питань, віднесених до її повноважень, виконання контрольних функцій відповідно до Конституції України створює з числа народних депутатів України комітети Верховної Ради України та обирає голів, перших заступників, заступників голів та секретарів цих комітетів.
Верховна Рада України у межах своїх повноважень може створювати тимчасові спеціальні комісії для підготовки і попереднього розгляду питань.
Верховна Рада України для проведення розслідування з питань, що становлять суспільний інтерес, утворює тимчасові слідчі комісії, якщо за це проголосувала не менш як одна третина від конституційного складу Верховної Ради України.
Висновки і пропозиції тимчасових слідчих комісій не є вирішальними для слідства і суду.
Організація і порядок діяльності комітетів Верховної Ради України, її тимчасових спеціальних і тимчасових слідчих комісій встановлюються законом.||http://zakon0.rada.gov.ua/laws/show/742-18/paran6#n6"

Article.create id: 90, section_id: 4, content: "Повноваження Верховної Ради України припиняються у день відкриття першого засідання Верховної Ради України нового скликання.
Президент України має право достроково припинити повноваження Верховної Ради України, якщо:
1) протягом одного місяця у Верховній Раді України не сформовано коаліцію депутатських фракцій відповідно до статті #83 цієї Конституції;
2) протягом шістдесяти днів після відставки Кабінету Міністрів України не сформовано персональний склад Кабінету Міністрів України;
3) протягом тридцяти днів однієї чергової сесії пленарні засідання не можуть розпочатися.
Рішення про дострокове припинення повноважень Верховної Ради України приймається Президентом України після консультацій з Головою Верховної Ради України, його заступниками та головами депутатських фракцій у Верховній Раді України.
Повноваження Верховної Ради України, що обрана на позачергових виборах, проведених після дострокового припинення Президентом України повноважень Верховної Ради України попереднього скликання, не можуть бути припинені протягом одного року з дня її обрання.
Повноваження Верховної Ради України не можуть бути достроково припинені Президентом України в останні шість місяців строку повноважень Верховної Ради України або Президента України.||http://zakon0.rada.gov.ua/laws/show/742-18/paran6#n6", add_bullets: false

Article.create id: 91, section_id: 4, content: "Верховна Рада України приймає закони, постанови та інші акти більшістю від її конституційного складу, крім випадків, передбачених цією Конституцією.||http://zakon0.rada.gov.ua/laws/show/v017p710-02|http://zakon0.rada.gov.ua/laws/show/v016p710-03"

Article.create id: 92, section_id: 4, content: "Виключно законами України визначаються:
1) права і свободи людини і громадянина, гарантії цих прав і свобод; основні обов'язки громадянина;
2) громадянство, правосуб'єктність громадян, статус іноземців та осіб без громадянства;
3) права корінних народів і національних меншин;
4) порядок застосування мов;
5) засади використання природних ресурсів, виключної (морської) економічної зони, континентального шельфу, освоєння космічного простору, організації та експлуатації енергосистем, транспорту і зв'язку;
6) основи соціального захисту, форми і види пенсійного забезпечення; засади регулювання праці і зайнятості, шлюбу, сім'ї, охорони дитинства, материнства, батьківства; виховання, освіти, культури і охорони здоров'я; екологічної безпеки;
7) правовий режим власності;
8) правові засади і гарантії підприємництва; правила конкуренції та норми антимонопольного регулювання;
9) засади зовнішніх зносин, зовнішньоекономічної діяльності, митної справи;
10) засади регулювання демографічних та міграційних процесів;
11) засади утворення і діяльності політичних партій, інших об'єднань громадян, засобів масової інформації;
12) організація і діяльність органів виконавчої влади, основи державної служби, організації державної статистики та інформатики;
13) територіальний устрій України;||http://zakon0.rada.gov.ua/laws/show/v011p710-01/paran54#n54
14) судоустрій, судочинство, статус суддів; засади судової експертизи; організація і діяльність прокуратури, <span class=\"removed-text\">органів дізнання і слідства</span>, нотаріату, <span class=\"added-text\">органів досудового розслідування</span>, органів і установ виконання покарань <span class=\"removed-text\">основи організації та діяльності адвокатури</span>; <span class=\"added-text\">порядок виконання судових рішень; засади організації та діяльності адвокатури;</span>||http://zakon0.rada.gov.ua/laws/show/1401-19/paran148#n148
15) засади місцевого самоврядування;
16) статус столиці України; спеціальний статус інших міст;
17) основи національної безпеки, організації Збройних Сил України і забезпечення громадського порядку;
18) правовий режим державного кордону;
19) правовий режим воєнного і надзвичайного стану, зон надзвичайної екологічної ситуації;
20) організація і порядок проведення виборів і референдумів;
21) організація і порядок діяльності Верховної Ради України, статус народних депутатів України;
22) засади цивільно-правової відповідальності; діяння, які є злочинами, адміністративними або дисциплінарними правопорушеннями, та відповідальність за них.||http://zakon0.rada.gov.ua/laws/show/v007p710-01
Виключно законами України встановлюються:
1) Державний бюджет України і бюджетна система України; система оподаткування, податки і збори; засади створення і функціонування фінансового, грошового, кредитного та інвестиційного ринків; статус національної валюти, а також статус іноземних валют на території України; порядок утворення і погашення державного внутрішнього і зовнішнього боргу; порядок випуску та обігу державних цінних паперів, їх види і типи;
2) порядок направлення підрозділів Збройних Сил України до інших держав; порядок допуску та умови перебування підрозділів збройних сил інших держав на території України;
3) одиниці ваги, міри і часу; порядок встановлення державних стандартів;
4) порядок використання і захисту державних символів;
5) державні нагороди;
6) військові звання, дипломатичні ранги та інші спеціальні звання;
7) державні свята;
8) порядок утворення і функціонування вільних та інших спеціальних зон, що мають економічний чи міграційний режим, відмінний від загального.
Законом України оголошується амністія.", add_bullets: false

Article.create id: 93, section_id: 4, content: "Право законодавчої ініціативи у Верховній Раді України належить Президентові України, народним депутатам України та Кабінету Міністрів України.
Законопроекти, визначені Президентом України як невідкладні, розглядаються Верховною Радою України позачергово.||http://zakon0.rada.gov.ua/laws/show/742-18/paran6#n6"

Article.create id: 94, section_id: 4, content: "Закон підписує Голова Верховної Ради України і невідкладно направляє його Президентові України.
Президент України протягом п'ятнадцяти днів після отримання закону підписує його, беручи до виконання, та офіційно оприлюднює його або повертає закон зі своїми вмотивованими і сформульованими пропозиціями до Верховної Ради України для повторного розгляду.||http://zakon0.rada.gov.ua/laws/show/v011p710-98|http://zakon0.rada.gov.ua/laws/show/v006p710-08
У разі якщо Президент України протягом встановленого строку не повернув закон для повторного розгляду, закон вважається схваленим Президентом України і має бути підписаний та офіційно оприлюднений.
Якщо під час повторного розгляду закон буде знову прийнятий Верховною Радою України не менш як двома третинами від її конституційного складу, Президент України зобов’язаний його підписати та офіційно оприлюднити протягом десяти днів. У разі якщо Президент України не підписав такий закон, він невідкладно офіційно оприлюднюється Головою Верховної Ради України і опубліковується за його підписом.||http://zakon0.rada.gov.ua/laws/show/742-18/paran124#n124
Закон набирає чинності через десять днів з дня його офіційного оприлюднення, якщо інше не передбачено самим законом, але не раніше дня його опублікування.||http://zakon0.rada.gov.ua/laws/show/v004p710-97"

Article.create id: 95, section_id: 4, content: "Бюджетна система України будується на засадах справедливого і неупередженого розподілу суспільного багатства між громадянами і територіальними громадами.||http://zakon0.rada.gov.ua/laws/show/v003p710-12/paran54#n54
Виключно законом про Державний бюджет України визначаються будь-які видатки держави на загальносуспільні потреби, розмір і цільове спрямування цих видатків.||http://zakon0.rada.gov.ua/laws/show/v003p710-12/paran56#n56
Держава прагне до збалансованості бюджету України.||http://zakon0.rada.gov.ua/laws/show/v026p710-08/paran54#n54|http://zakon0.rada.gov.ua/laws/show/v003p710-12/paran54#n54
Регулярні звіти про доходи і видатки Державного бюджету України мають бути оприлюднені."

Article.create id: 96, section_id: 4, content: "Державний бюджет України затверджується щорічно Верховною Радою України на період з 1 січня по 31 грудня, а за особливих обставин - на інший період.
Кабінет Міністрів України не пізніше 15 вересня кожного року подає до Верховної Ради України проект закону про Державний бюджет України на наступний рік. Разом із проектом закону подається доповідь про хід виконання Державного бюджету України поточного року.||http://zakon0.rada.gov.ua/laws/show/v003p710-12/paran55#n55"

Article.create id: 97, section_id: 4, content: "Кабінет Міністрів України відповідно до закону подає до Верховної Ради України звіт про виконання Державного бюджету України.
Поданий звіт має бути оприлюднений."

Article.create id: 98, section_id: 4, content: "Контроль від імені Верховної Ради України за надходженням коштів до Державного бюджету України та їх використанням здійснює Рахункова палата.
Організація, повноваження і порядок діяльності Рахункової палати визначаються законом.||http://zakon0.rada.gov.ua/laws/show/586-18/paran5#n5|http://zakon0.rada.gov.ua/laws/show/742-18/paran6#n6"

Article.create id: 99, section_id: 4, content: "Грошовою одиницею України є гривня.
Забезпечення стабільності грошової одиниці є основною функцією центрального банку держави - Національного банку України."

Article.create id: 100, section_id: 4, content: "Рада Національного банку України розробляє основні засади грошово-кредитної політики та здійснює контроль за її проведенням.
Правовий статус Ради Національного банку України визначається законом."

Article.create id: 101, section_id: 4, content: "Парламентський контроль за додержанням конституційних прав і свобод людини і громадянина здійснює Уповноважений Верховної Ради України з прав людини."

Article.create id: 102, section_id: 5, content: "Президент України є главою держави і виступає від її імені.
Президент України є гарантом державного суверенітету, територіальної цілісності України, додержання Конституції України, прав і свобод людини і громадянина."

Article.create id: 103, section_id: 5, content: "Президент України обирається громадянами України на основі загального, рівного і прямого виборчого права шляхом таємного голосування строком на п'ять років.||http://zakon2.rada.gov.ua/laws/show/v005p710-14/paran27#n27
Президентом України може бути обраний громадянин України, який досяг тридцяти п'яти років, має право голосу, проживає в Україні протягом десяти останніх перед днем виборів років та володіє державною мовою.
Одна й та сама особа не може бути Президентом України більше ніж два строки підряд.||http://zakon2.rada.gov.ua/laws/show/v022p710-03
Президент України не може мати іншого представницького мандата, обіймати посаду в органах державної влади або в об'єднаннях громадян, а також займатися іншою оплачуваною або підприємницькою діяльністю чи входити до складу керівного органу або наглядової ради підприємства, що має на меті одержання прибутку.
Чергові вибори Президента України проводяться в останню неділю березня п’ятого року повноважень Президента України. У разі дострокового припинення повноважень Президента України вибори Президента України проводяться в період дев’яноста днів з дня припинення повноважень.||http://zakon2.rada.gov.ua/laws/show/v005p710-14/paran26#n26
Порядок проведення виборів Президента України встановлюється законом."

Article.create id: 104, section_id: 5, content: "Новообраний Президент України вступає на пост не пізніше ніж через тридцять днів після офіційного оголошення результатів виборів, з моменту складення присяги народові на урочистому засіданні Верховної Ради України.
Приведення Президента України до присяги здійснює Голова Конституційного Суду України.
Президент України складає таку присягу:<br/><blockquote>\"Я, (ім'я та прізвище), волею народу обраний Президентом України, заступаючи на цей високий пост, урочисто присягаю на вірність Україні. Зобов'язуюсь усіма своїми справами боронити суверенітет і незалежність України, дбати про благо Вітчизни і добробут Українського народу, обстоювати права і свободи громадян, додержуватися Конституції України і законів України, виконувати свої обов'язки в інтересах усіх співвітчизників, підносити авторитет України у світі\".</blockquote>
Президент України, обраний на позачергових виборах, складає присягу у п'ятиденний строк після офіційного оголошення результатів виборів.||http://zakon2.rada.gov.ua/laws/show/v017p710-02/paran54#n54"

